<!-- 成功將產品名稱都新增到資料表中 -->
<?php
header("content-type:text/html; charset=utf-8");
$bookname = array("唐吉訶德","雙城記","童軍警探","魔戒","小王子","無人生還","紅樓夢","哈比人","三千年豔屍記","達文西密碼","麥田捕手","牧羊少年奇幻之旅","海蒂的學徒和旅行年代","嬰幼兒保健常識","清秀佳人","黑神駒","玫瑰的名字","夏綠蒂的網","小兔彼得的故事","哈利波特－死神的聖物","天地一沙鷗","致加西亞的信","天使與魔鬼","美化家居花園與新食譜","鋼鐵是怎樣煉成的","戰爭與和平","木偶奇遇記","治癒你的身體","凱恩與阿貝爾","安妮的日記","追隨他的腳步","梅岡城故事","風月泣殘紅","亂世佳人","百年孤寂","標竿人生","刺鳥","思考致富","匿名戒酒協會巨著","斯托夫媽咪的抗爭","好餓的毛毛蟲","消失的偉大地球","貝蒂克羅克食譜","誰動了我的奶酪","柳林風聲","一九八四","聖境預言書","教父","狼圖騰","快樂的妓女","大白鯊","愛你永遠","蘇菲的世界","女人們的房間","野獸冒險樂園","怕飛","烹飪的樂趣","月亮，晚安","猜猜我有多愛你","與成功有約","幕府將軍","遲鈍的小狗","聖殿春秋","卡內基溝通與人際關係——如何贏取友誼與影響他人","香水：一個謀殺犯的故事","嬰幼兒養育手冊","馬語者","風之影","最後14堂星期二的課","小墓地","依隨你心","異鄉人","查理與巧克力工廠","尋找佩頓","沙丘","鼠疫","人間失格","裸猿","麥迪遜之橋","瓦解","先知","驅魔人","第22條軍規","針眼","時間簡史：從大爆炸到黑洞","戴帽子的貓","蘇西的世界","鴻：三代中國女人的故事","聖埃維塔","家庭看護秘決","夜","追風箏的孩子","于丹《論語》心得","完整女人","知識價值革命","中國社會主義經濟問題研究","你的降落傘是什麼顏色？","龍紋身的女孩","哈利·波特","彼得兔的故事");

$link = @mysqli_connect("localhost", "root", "") or die(mysqli_connect_error());
$result = mysqli_query($link, "set names utf8");
mysqli_select_db($link, "cy_mysql");

for ($i = 4; $i <= 99; $i++) {
	echo $bookname[$i] . "<br />";
	$commandText = "INSERT INTO product_info (product_name) VALUES('$bookname[$i]')";
	$result = mysqli_query($link, $commandText);
}
mysqli_close($link);
echo "<br />-- Done --";
?>